{
    "0: Interacting with certain stone blocks can reveal hidden resources or change the block type, and the player can obtain resources not directly related to the block they interact with.": 0.5,
    "1: The action move_down does not change the player's location under certain conditions, possibly due to an obstacle or game mechanic preventing movement in that direction.": 1.0,
    "3: The player can move to an adjacent sand block.": 1.0,
    "5: Moving up on the path changes the player's position relative to surrounding objects without affecting the player's health, food, drink, or energy levels.": 1.0,
    "8: The player can move freely on paths and stone in the four cardinal directions as long as the way is clear.": 0.5,
    "10: The player can move from the path to the iron block.": 0.9,
    "11: Encountering skeletons or arrows can cause the player to lose health.": 0.5,
    "12: Interacting with certain coal blocks can trigger environmental changes, such as turning the coal block into lava.": 1.0,
    "14: Interacting with a tree block turns it into a path block.": 0.9,
    "17: Making a wood pickaxe requires specific materials that the player might not have or cannot be done without accessing a crafting table.": 1.0,
    "21: Interacting with water blocks replenishes the player's drink status.": 1.0,
    "22: Interacting with the cow block can increase the player's food status.": 1.0,
    "23: The player can move freely on the path but cannot pass through stone blocks.": 0.0,
    "24: Interacting with a stone block can transform it into a different block (in this case, a diamond block) and may also add wood to the player's inventory.": 0.5,
    "29: Standing on grass restores the player's health.": 1.0,
    "31: Interacting with tree blocks converts them into path blocks and adds one coal to the player's inventory.": 1.0,
    "32: The player can move onto stone blocks.": 1.0,
    "33: The action to place a table cannot be executed without the required materials or crafting process being explicitly mentioned or available in the game mechanics as understood from the provided descriptions.": 1.0,
    "35: Interacting with a tree block changes it into a path block.": 0.5,
    "36: Interacting with a tree block yields coal and converts the tree block into a path block.": 1.0,
    "37: The player can move in the direction specified, changing their position relative to objects around them without affecting their health, food, drink, energy levels, or inventory.": 0.5,
    "38: Interacting with a tree block can result in obtaining coal and changing the tree block to a path block.": 1.0,
    "40: Iron cannot be obtained without the proper tool or the \"do\" action is not suitable for mining iron.": 0.5,
    "42: Interacting with the grass block does not yield resources or cause changes.": 0.0,
    "43: Moving to an adjacent path location does not consume health, food, drink, or energy.": 0.5,
    "44: The action to make a wood pickaxe either requires additional resources or knowledge not present in the player's current inventory and state, or it is not a valid action within the game's mechanics.": 0.0,
    "46: The player can move to adjacent path tiles or onto tiles with certain objects without consuming health, food, drink, or energy.": 0.5,
    "48: Moving towards a skeleton does not automatically result in damage to the player.": 0.5,
    "49: The player can move left on stone without any negative consequences.": 1.0,
    "50: Diamond blocks cannot be mined or collected with the current tools or actions the player has attempted.": 0.0,
    "52: Moving on the path does not consume health, food, drink, or energy resources, and the path is navigable without restrictions.": 0.75,
    "53: Standing on the iron can increase the player's health.": 1.0,
    "54: The player can use the table and wood to craft a wood pickaxe.": 1.0,
    "55: Interacting with a tree block may change it to a path block, but does not guarantee wood will be added to the player's inventory.": 0.5,
    "56: Interacting with stone blocks can yield various resources, such as wood or stone.": 0.5,
    "58: The action \"place_table\" cannot be directly executed without meeting a specific condition or performing a prior action, such as crafting the table first or being on a specific type of block.": 1.0,
    "59: Interacting with a grass block without a specific action does not yield any results.": 0.0,
    "61: Moving onto a water block without proper equipment or method causes damage. Performing the \"do\" action while on a water block represents drinking, which can restore health and drink levels but slightly decreases food.": 0.5,
    "62: The table cannot be placed on the path without meeting specific conditions or having the necessary materials.": 1.0,
    "63: Moving onto a stone block consumes food.": 0.0,
    "65: The player cannot place a table without the required materials or the stone block does not allow placing a table.": 0.5,
    "69: Moving to different terrains (path, grass) does not consume health, food, drink, or energy. Proximity to environmental hazards like lava does not cause immediate harm.": 0.5,
    "70: To make a wood pickaxe, specific requirements must be met, such as having a crafting table and the necessary materials in the inventory. To place a table, one must first have a table in the inventory.": 1.0,
    "71: Interacting with a water block while standing on water increases the player's drink status.": 1.0,
    "73: The iron block cannot be mined with a wood pickaxe or requires a different action to mine.": 1.0,
    "74: Moving on the path does not consume health, food, drink, or energy, and allows the player to navigate through different coordinates to observe or interact with objects around them.": 0.5,
    "75: The player can be harmed by attacks from skeletons even while sleeping.": 0.0,
    "76: Interacting with a tree block can change it to a path block without yielding resources or affecting the player's status.": 0.5,
    "79: Interacting with the grass block consumes food and restores health.": 0.0,
    "81: The player can move left on the path.": 1.0,
    "82: Interacting with a tree block consumes energy and produces coal.": 0.5,
    "84: Moving from one stone block to another does not consume health, food, drink, or energy.": 0.5,
    "87: Moving consumes food but not drink. Being on grass may regenerate health over time.": 0.5,
    "91: Standing on the grass can increase the player's health.": 1.0,
    "92: Moving into water causes damage to the player.": 1.0,
    "93: Skeletons can shoot arrows at the player, causing damage.": 0.0,
    "94: The player can move to adjacent stone blocks.": 0.8,
    "95: Moving onto the grass can restore the player's health.": 1.0,
    "97: Moving does not consume health, food, drink, or energy, and the player can stand on stone blocks.": 0.5,
    "98: Standing on the iron can restore the player's health.": 1.0,
    "101: The action \"do\" cannot be used to mine or obtain diamonds from a diamond block.": 0.0,
    "103: Interacting with a stone block allows the player to mine it and obtain a stone.": 0.5,
    "104: The player can move right on the path to change their position.": 0.75,
    "105: Interacting with a tree block can yield coal and change the tree block into a path block.": 1.0,
    "107: Crafting a wood pickaxe requires a table and consumes wood from the player's inventory.": 1.0,
    "108: The player can move freely on the path without any penalties to their health, food, drink, or energy levels.": 0.5,
    "109: Interacting with a water block increases the player's drink status.": 1.0,
    "110: Interacting with a cow block increases the player's food level.": 1.0,
    "112: Interacting with certain blocks can reveal hidden resources or change the blocks, but collecting diamonds may require a specific tool or action not yet performed by the player.": 1.0,
    "114: Moving from stone to path does not affect the player's health, food, drink, or energy.": 1.0,
    "115: Moving into water can cause damage to the player.": 1.0,
    "117: Moving to an adjacent path tile does not consume health, food, drink, or energy.": 1.0,
    "123: Mining coal does not increase the player's coal inventory, possibly due to the tool used or a specific game rule regarding coal collection.": 0.0,
    "124: The table cannot be placed on the stone block or requires additional conditions to be met for placement.": 0.0,
    "127: The player can move left on the path without any penalties to their status.": 1.0,
    "130: The player can move freely on path and stone blocks.": 0.9,
    "134: The player can move from path to sand without any negative effects on their status.": 1.0,
    "135: Both path and stone blocks are walkable.": 1.0,
    "138: Moving from stone to path does not affect the player's health, food, drink, or energy levels.": 1.0,
    "141: Skeletons can shoot arrows at the player when the player is in front of them, but moving away quickly enough can prevent the player from being hit.": 0.5,
    "143: Water blocks are not walkable, and the player cannot move directly onto them from adjacent blocks.": 0.0,
    "144: Interacting with a tree block can result in obtaining coal and changing the tree block into a path block.": 1.0,
    "146: Attempting to access or move towards a diamond without the correct conditions or equipment can cause damage to the player.": 0.5,
    "147: Moving on the path does not consume health, food, drink, or energy, and does not automatically collect items into the inventory.": 0.5,
    "148: Moving between grass, stone, and path terrains does not affect the player's health, food, drink, or energy levels.": 0.5,
    "150: The player can move on the path to discover and approach objects like diamonds.": 0.5,
    "151: Moving to specific blocks such as iron can restore the player's health.": 1.0,
    "152: Moving into water causes damage to the player, while moving back onto grass restores health if the player was previously damaged.": 1.0,
    "153: The diamond block cannot be mined or interacted with using the \"do\" action or with the tools currently in the player's inventory.": 0.0,
    "154: Moving can result in health loss, potentially due to attacks or environmental hazards. Interacting with certain blocks can reveal hidden items or resources, and performing actions can add items to the player's inventory.": 0.8,
    "156: The action \"do\" does not collect coal, or a wood pickaxe cannot mine coal.": 0.0,
    "157: Being in water or moving into water can cause damage to the player.": 1.0,
    "158: Interacting with the tree block yields coal, transforms the tree block into a path block, and consumes 1 energy.": 0.5,
    "159: Interacting with the grass block using the \"do\" action has no effect.": 0.0,
    "160: Crafting items like wood or stone pickaxes requires specific conditions to be met, such as having a crafting table placed and used, along with possessing the necessary resources in the inventory.": 1.0,
    "161: Moving on the path does not consume health, food, drink, or energy.": 0.5,
    "162: Interacting with the stone block turns it into a diamond block and adds wood to the player's inventory without costing health, food, drink, or energy.": 0.5,
    "164: The player can move from one path tile to adjacent path tiles.": 0.8,
    "165: Interacting with or being adjacent to lava blocks without specific protective measures or tools does not result in harm or resource collection. The \"do\" action, as attempted by the player, is ineffective for interacting with or altering lava blocks with the current tools or methods available in the player's inventory.": 0.5,
    "166: Moving from the path to the iron block does not consume additional resources or cause damage.": 0.75,
    "167: Interacting with grass blocks using the generic \"do\" action does not produce any changes or yield resources.": 0.0,
    "168: The table requires specific actions or items to interact with for a result to occur.": 0.8,
    "169: Interacting with a water block increases the player's drink level. Being in proximity to a skeleton can result in the player being hit by an arrow, causing a decrease in health.": 0.5,
    "173: Making a wood pickaxe requires additional materials or a specific procedure that was not met.": 0.0,
    "174: Players can move from grass to path without any impact on their status.": 0.0,
    "175: Interacting with a tree block changes it to a path block without yielding additional resources.": 0.5,
    "176: Being on grass restores health by 1 point, being on water reduces health by 1 point, and certain actions like moving might consume drink resources.": 0.75,
    "177: Standing on the iron block increases the player's health.": 1.0,
    "178: Moving through certain areas or performing specific actions may result in health reduction due to hidden hazards or environmental effects.": 0.7,
    "179: Interacting with stone blocks can yield stone and potentially reveal hidden resources like diamonds. Actions consume food.": 0.5,
    "181: Making a stone pickaxe requires specific materials and/or conditions that were not met by the player.": 1.0,
    "183: The player can move on the path and grass without any negative effects on their status.": 0.0,
    "186: Moving left on the path does not affect the player's health, food, drink, or energy levels.": 1.0,
    "188: Interacting with stone blocks yields stone and changes the block to a diamond. Interacting with tree blocks yields coal, changes the block to a path, and consumes the player's drink resource.": 0.75,
    "190: Moving can decrease the player's health under certain conditions related to the player's status or the environment.": 0.7,
    "192: The lava block is impassable.": 1.0,
    "194: Moving consumes energy. Health can decrease due to certain conditions or environmental factors, but not necessarily directly due to the act of moving.": 0.0,
    "195: The diamond block cannot be interacted with using the action \"do\" or the player requires a specific tool to interact with the diamond block.": 1.0,
    "197: Interacting with the path block does not alter the player's status or inventory. Moving actions (move_left, move_down) change the player's position in the environment.": 0.5,
    "198: To make a stone pickaxe, specific conditions or resources beyond having wood and stone might be required, such as a crafting table or additional resources not present in the player's inventory.": 1.0,
    "199: Interacting with iron blocks requires a specific tool or action that was not utilized in this instance.": 1.0,
    "1. Entering water decreases health by 1.": 1.0,
    "2. Being on grass may heal the player or allow health regeneration under certain conditions.": 1.0,
    "3. Interacting (\"do\") with the grass block without specific tools or actions yields no change.": 0.0,
    "4. Interacting with certain objects (like the stone block, though this might be a misinterpretation or a game inconsistency) consumes energy and can yield resources, such as wood.": 0.5,
    "203: The table cannot be placed without meeting specific conditions or having the necessary materials.": 1.0,
    "204: Interacting with a stone block allows the player to mine it, adding the stone to their inventory and potentially revealing items or blocks behind it.": 0.5,
    "207: Stone cannot be placed without specifying a valid target location or surface.": 1.0,
    "209: Interacting with a tree block through the \"do\" action converts the tree block into a path block without adding resources to the player's inventory.": 0.5,
    "210: Moving on the path allows the player to change their position and observe different surroundings without directly affecting their health, food, drink, energy levels, or inventory.": 0.5,
    "211: Moving up in the presence of a tree directly in front of the player does not change the player's position or surroundings.": 1.0,
    "213: The stone block is traversable.": 1.0,
    "215: Interacting with a cow can increase the player's food status.": 1.0,
    "217: Moving onto certain tiles or in specific directions under certain conditions can cause health damage to the player.": 0.5,
    "219: Standing on the grass heals the player.": 1.0,
    "220: Moving to an adjacent tile does not affect the player's health, food, drink, energy, or automatically collect resources.": 0.5,
    "221: Moving in any direction does not consume health, food, drink, or energy.": 0.0,
    "224: Interacting with certain stone blocks may transform them into diamonds and provide the player with wood.": 0.7,
    "225: The path is walkable without consuming health, food, drink, energy, or altering the player's inventory.": 0.5,
    "226: Direct interaction with the diamond block does not allow the player to collect it, and the player may need specific tools or actions to interact with or collect resources effectively. Furthermore, creating items or placing objects like a table may require specific conditions or materials that were not met or the game did not recognize the actions attempted by the player.": 1.0,
    "227: Interacting with a tree block collects coal and transforms the tree block into a path block.": 1.0,
    "229: Interacting with a tree block can change it to a path block without yielding resources or items to the player's inventory.": 0.0,
    "230: Moving on paths does not consume health, food, drink, energy, or affect the player's inventory.": 0.5,
    "231: Interacting (do) with the water block replenishes the player's drink meter.": 1.0,
    "232: Interacting with a tree block yields coal and changes it into a path block.": 1.0,
    "235: Moving from the path to the stone can cause damage to the player.": 0.0,
    "236: Interacting with a stone block results in obtaining wood.": 1.0,
    "244: A table cannot be placed without having one in the inventory or the sand block might not be a suitable location for placing a table without explicit specification.": 0.75,
    "245: Moving right on the path changes the player's position without affecting health, food, drink, or energy levels.": 1.0,
    "246: Interacting with the table allows the player to craft items, using materials from their inventory. Crafting a wood sword consumes 1 wood.": 1.0,
    "247: The player requires a specific tool or condition to mine diamonds, which they currently do not possess or meet. Trees can be interacted with to change them into paths, possibly simulating the action of cutting down the tree without explicitly stating the need for a tool, or the action automatically uses the correct tool if available in the inventory.": 1.0,
    "248: The player can move on the path.": 1.0,
    "249: Interacting with a tree can yield resources, such as coal.": 1.0,
    "251: Moving into the water block without interaction causes damage to the player, but using the \"do\" action on the water block replenishes the player's drink status without causing damage.": 1.0,
    "252: The player can move on stone blocks.": 1.0,
    "253: The player can move between iron, path, and stone blocks without restrictions.": 0.5,
    "254: Interacting with the grass block without a specific action or tool does not yield any result.": 0.0,
    "256: Interacting with a tree block changes it to a path block and can affect the player's food status.": 0.5,
    "257: The player can move freely between path and stone tiles without any impact on their health, food, drink, or energy status.": 0.75,
    "258: The player can move on both path and grass blocks.": 1.0,
    "259: Interacting with a tree block replaces it with a path and adds coal to the player's inventory.": 1.0,
    "262: The diamond block cannot be passed through or occupied by the player.": 1.0,
    "264: The stone block can be mined and collected into the inventory when the player uses a wood pickaxe to interact with it.": 0.5,
    "265: The player cannot move to the position where the diamond is located, possibly due to an obstruction or game rule preventing movement to that specific location.": 1.0,
    "269: Interacting (doing) with certain blocks can transform them and yield resources.": 1.0,
    "270: The player can move in different directions onto certain types of blocks such as stone and path without consuming health, food, drink, or energy.": 0.5,
    "272: Players can move right on the grass without any negative effects on their status.": 0.0,
    "273: The water block can cause damage to the player.": 1.0,
    "274: The player can move freely on path and stone blocks, and moving does not affect health, food, drink, or energy levels under normal conditions.": 0.5,
    "276: The player can move left onto a path tile without consuming health, food, drink, or energy, and without altering their inventory.": 1.0,
    "279: Moving on the path does not consume health, food, drink, or energy, and encountering objects does not automatically trigger interactions.": 0.5,
    "280: The table is used for crafting items, and specific actions must be taken (such as \"make_wood_pickaxe\") while at the table to craft certain items, assuming the player has the required resources.": 1.0,
    "283: Moving from grass to path does not affect the player's health, food, drink, or energy levels.": 0.0,
    "284: Moving on grass does not consume health, food, drink, or energy resources.": 0.0,
    "288: The player can move across grass, path, and stone terrains without any immediate negative effects on their health, food, drink, or energy status.": 0.5,
    "290: Moving between blocks (path, stone) does not consume health, food, drink, or energy, nor does it automatically collect resources or items.": 0.5,
    "292: Moving onto a stone block is safe and does not affect the player's health, food, drink, or energy levels.": 1.0,
    "294: Interacting with a tree block results in obtaining coal and the tree being replaced by a path.": 1.0,
    "295: The player can move from path to grass.": 0.5,
    "296: The player can move onto path and stone tiles without any negative effects on their status.": 0.9,
    "297: Moving changes the player's location and the objects they encounter but does not consume health, food, drink, or energy.": 0.5,
    "299: Interacting (\"do\") with certain blocks does not necessarily yield that block as a resource; the outcome can vary, such as increasing wood in the player's inventory instead.": 0.8,
    "300: Interacting with a tree block results in obtaining coal and changing the tree block to a path.": 1.0,
    "305: Being adjacent to lava does not automatically harm the player or affect their status.": 1.0,
    "307: Interacting with the iron block without the proper tool or method does not yield any result.": 1.0,
    "309: The player can move between different types of surfaces such as path and stone.": 1.0,
    "311: Sand blocks are traversable, and players can move horizontally across the map.": 0.9,
    "313: Interacting with a tree block can yield coal and change the tree block to a path block.": 1.0,
    "319: Interacting with a grass block using the \"do\" action does not yield any results or changes.": 0.0,
    "320: The player cannot collect coal by simply interacting with it without the proper tool or action.": 1.0,
    "324: The player cannot mine or acquire diamonds by simply using the action \"do\" without the proper tool or method.": 1.0,
    "325: The player can move freely on path blocks without any cost to health, food, drink, or energy.": 0.5,
    "326: Interacting with a tree block changes it to a path block and gives the player coal.": 1.0,
    "328: The player cannot place a table without the correct materials or if the action is not applicable in the current situation. The player cannot mine or interact with the diamond block without the necessary tool. Moving left does not change the player's relative position to the objects, possibly due to obstacles or the game's movement mechanics.": 0.5,
    "331: Interacting with a tree block collects coal and converts the tree block into a path block.": 1.0,
    "334: The diamond block cannot be mined or collected with the current tools or actions provided by the player.": 0.0,
    "335: Interacting with a water block while on the water increases the player's drink level.": 1.0,
    "339: Interacting with the skeleton using the current method does not harm or affect the skeleton.": 0.0,
    "342: The path is a traversable block, and moving does not consume health, food, drink, or energy.": 0.5,
    "344: Moving on the grass passively regenerates the player's health.": 1.0,
    "345: The tree blocks the player's movement.": 1.0,
    "347: Interacting (do) with a tree can remove the tree from the environment, but may require specific tools or conditions to yield resources.": 0.75,
    "348: The player can move right on the path without any negative effects on their health, food, drink, or energy levels.": 0.75,
    "349: Interacting with the cow block without the proper tool or action does not yield food, drink, or other resources.": 0.0,
    "353: Interacting (doing action 'do') with the grass block does not yield resources or have an effect.": 0.0,
    "356: Moving can under certain conditions restore the player's health, but this effect does not occur with every movement.": 0.5,
    "357: Interacting (do) with the coal block without the proper tool or method does not result in the collection of coal or any other effect.": 0.5,
    "358: The player can move between path and stone tiles without any penalties to their health, food, drink, or energy.": 1.0,
    "359: Interacting with tree and stone blocks while having a wood_pickaxe in the inventory allows the player to collect wood and stone respectively without harm or significant resource depletion.": 0.5,
    "360: Interacting with stone blocks can turn them into diamonds.": 0.5,
    "361: The player can move onto different types of blocks (e.g., from path to stone) without consuming health, food, drink, or energy, and without restrictions based on their current inventory or status.": 0.5,
    "364: Interacting with stone blocks changes them to diamond blocks, and interacting with tree blocks adds wood to the player's inventory.": 0.5,
    "365: The player can move to adjacent path tiles.": 0.8,
    "366: Moving does not consume health, food, drink, or energy resources, and it does not directly affect the player's inventory.": 0.5,
    "367: Moving to or being on the grass can restore the player's health.": 1.0,
    "368: Interacting with a water block can replenish the player's drink status.": 1.0,
    "370: Moving left on the path does not consume health, food, drink, or energy.": 0.9,
    "371: Moving through certain areas or past certain objects can cause health to decrease, indicating a potential environmental hazard or effect not directly observed or described in the action descriptions.": 0.5,
    "374: The player cannot place a table or make a wood pickaxe without the necessary materials or under certain conditions.": 0.8,
    "375: Interacting with a tree block gives coal to the player's inventory and changes the tree block to a path block.": 1.0,
    "376: Trees act as obstacles that the player cannot move through on the path.": 1.0,
    "377: Standing on the iron block can increase the player's health. Interacting with the path block without a specific tool or action does not result in any change.": 0.75,
    "378: The diamond block cannot be mined or interacted with through the action \"do\" or requires specific tools to mine.": 0.0,
    "379: The player can move from one stone block to another without any immediate impact on their status or inventory.": 1.0,
    "380: The \"do\" action can be used to interact with and change certain objects in the environment, such as turning a tree into a path.": 1.0,
    "382: The skeleton can cause damage to the player.": 0.0,
    "383: Interacting with a coal block using the \"do\" action causes the player to mine or remove the coal block, changing the environment in front of the player.": 0.5,
    "385: Moving from grass to path does not affect the player's health, food, drink, or energy.": 0.8,
    "387: Skeletons or their arrows can cause damage to the player, even when the player is sleeping.": 0.0,
    "389: Interacting with a tree can remove it from the path but does not necessarily result in obtaining wood if the proper tool or method is not used.": 0.75,
    "390: Moving between sand, stone, and path terrains does not affect the player's health, food, drink, or energy status.": 0.5,
    "391: Diamonds cannot be collected or mined without the appropriate tool or action.": 1.0,
    "393: Interacting with a tree block transforms it into a path block and adds coal to the player's inventory.": 1.0,
    "394: The player cannot move through the tree block.": 1.0,
    "396: Making a wood pickaxe requires more than just having wood in the inventory; there may be additional resources required or specific conditions that must be met.": 1.0,
    "397: Moving to an adjacent block does not consume health, food, drink, or energy, and the player can successfully move onto an iron block.": 0.5,
    "398: The player can move on stone surfaces without any detriment to health, food, drink, or energy levels.": 1.0,
    "400: Moving from one block to another does not consume health, food, drink, or energy by itself.": 0.5,
    "401: Both path and stone tiles are navigable and moving between them does not immediately affect the player's health, food, drink, or energy statuses.": 1.0,
    "404: The player can move from stone to path.": 1.0,
    "405: Interacting with a tree block removes it from its original position and may generate a new tree block at a different location or move it.": 0.0,
    "406: The player cannot place a table without having a table in their inventory, or the action was not executed correctly.": 0.0,
    "407: Being near a diamond causes damage to the player.": 0.0,
    "408: The player cannot make a stone pickaxe without first successfully placing a table and having the necessary materials and tools available.": 0.75,
    "409: The player needs a table in their inventory to place it, or there is a specific requirement or method to place a table that was not met or followed.": 0.0,
    "411: The player can move from stone to path without any negative consequences.": 1.0,
    "412: Interacting with a tree block can result in obtaining coal and changing the tree block into a path.": 1.0,
    "414: Interacting with certain stone blocks can transform them into diamonds and reward the player with wood.": 0.5,
    "415: Interacting (doing action) with a tree block can change it to a path block without affecting the player's inventory or status.": 0.5,
    "416: Moving can decrease the player's health under certain conditions.": 0.7,
    "417: The player cannot move through or into the space occupied by a tree.": 1.0,
    "418: The player can move onto stone blocks without immediate effect on health, food, drink, or energy levels.": 1.0,
    "420: Interacting with a tree block consumes food energy and changes the tree block into a path block.": 0.5,
    "421: The player can move freely between path and stone tiles without any penalties to their status.": 1.0,
    "422: The player cannot interact with or mine the diamond block without the appropriate tool or action.": 1.0,
    "423: Moving changes the player's location but does not affect the player's health, food, drink, energy, or inventory directly.": 0.5,
    "424: Interacting with stone blocks transforms them into diamond blocks and may increase the player's wood inventory by 1 or increase the stone inventory by 1 after the interaction.": 0.5,
    "425: Being on a water block can decrease the player's health, but interacting with a water block can increase the player's drink status.": 1.0,
    "428: Interacting with a tree block yields coal and converts the tree block into a path.": 1.0
}